Revit 2026 API

# SpatialElementLocation Property

---

The location of the element.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public override Location Location { get; }
```
```vb
Public Overrides ReadOnly Property Location As Location
	Get
```
```cpp
public:
virtual property Location^ Location {
	Location^ get () override;
}
```
```fsharp
abstract Location : Location with get
override Location : Location with get
```

#### Property Value

Location

This is the location of the room within the level. The Z location should be the elevation of the level and not changeable.

#### Reference

SpatialElement Class

Autodesk.Revit.DB Namespace